#

# 판다스를  활용한 데이터 이해

### 01 파이썬 기본 다지기

In [2]:
myfood = ['banana','apple','candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])

banana
apple
candy

In [3]:
for item in myfood:
    print(item)

banana
apple
candy

### 02 딕셔너리(Dictionary)

In [5]:
# 리스트, 튜플 < 딕셔너리, 시리즈 < 데이터프레임
dict1 = {'one':'하나','two':'둘','three':'셋'}     
dict2 = {1:'하나',2:'둘',3:'셋'}                   # key값을 숫자로 명명할 수 있다.
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [6]:
print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

### 03 판다스 모듈 불러오기

In [15]:
import pandas as pd
from pandas import Series, DataFrame  # Series 사용시 굳이 pd.을 붙이지 않으려면 라이브러리에서 특정 모듈만 불러오면 된다.

In [17]:
import matplotlib as mpl
import matplotlib.pyplot as plt

In [18]:
print("pandas 버전 확인 : ", pd.__version__)
print("matplotlib 버전 확인 : ", mpl.__version__)

pandas 버전 확인 :  1.2.4
matplotlib 버전 확인 :  3.3.4

In [25]:
score = Series([1000,14000,3000,30000,10000])
print('자료형:',type(score))
print(score)

자료형: <class 'pandas.core.series.Series'>
0     1000
1    14000
2     3000
3    30000
4    10000
dtype: int64

In [31]:
print(score.index)
print(list(score.index))
print(score.values)       # 자료형이 list 처럼 보이지만, 자료형은 numpy 이다.

print()

print(type(score.index))
print(type(score.values))

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000 30000 10000]

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'numpy.ndarray'>

In [32]:
score = Series([1000,14000,3000],
               index = ['2019-05-01','2019-05-02','2019-05-03'])
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

#### 실습 1-1) Series 만들기

In [43]:
bank = Series([53380,218142,56091,74200,543533])
                
print(bank)

0     53380
1    218142
2     56091
3     74200
4    543533
dtype: int64

#### 실습 1-2) index 넣기

In [44]:
bank_idx = Series([53380,218142,56091,74200,543533],
              index = ['09_1st','09_2nd','09_3rd','09_4th','09_5th'])
print(bank_idx)

09_1st     53380
09_2nd    218142
09_3rd     56091
09_4th     74200
09_5th    543533
dtype: int64

In [45]:
for idx in score.index:
    print(idx)

2019-05-01
2019-05-02
2019-05-03

In [46]:
for value in score.values:
    print(value)

1000
14000
3000

#### 실습 1-2+) index 범위지정

In [51]:
import pandas as pd

In [54]:
# 100개의 index를 지정해줄 때
idx = pd.date_range(start='2020-01-01', end='2020-01-03').tolist()
auto_idx = Series( ['a', 'b', 'c'], 
                   index=idx)
auto_idx

2020-01-01    a
2020-01-02    b
2020-01-03    c
dtype: object

#### 실습 1-3) 두 팀의 점수 합산해보기

In [49]:
from pandas import Series

In [67]:
gildong = Series([1500,3000,2500],
                index = ['2019-05-01','2019-05-02','2019-05-03'])
dooly = Series([3000,3000,2000],
             index = ['2019-05-01','2019-05-03','2019-05-02'])

In [68]:
gildong + dooly
# 서로 같은 index의 value끼리 계산한다.

2019-05-01    4500
2019-05-02    5000
2019-05-03    5500
dtype: int64

#### 실습 1-4) 데이터는 1~90, 인덱스는 3개월치 날짜로 지정

In [70]:
value = list(range(1,91))
idx = pd.date_range(start='2020-01-01', end='2020-03-30').tolist()

three_month_90 = Series( value, 
                        index=idx)

print(three_month_90)

2020-01-01     1
2020-01-02     2
2020-01-03     3
2020-01-04     4
2020-01-05     5
              ..
2020-03-26    86
2020-03-27    87
2020-03-28    88
2020-03-29    89
2020-03-30    90
Length: 90, dtype: int64

#

#

# 데이터 프레임(DataFrame)의 이해

* Pandas의 기본 자료형
* Seaborn 데이터 (load_dataset() )
  * seaborn에 들어가는 기본적인 데이터 자료형 pandas
* plotly에서도 pandas호환

### 01 DataFrame 생성하기
* Dictionary -> DataFrame
* Series     -> DataFrame

In [72]:
from pandas import DataFrame

In [80]:
# <데이트 프레임 형태의 자료 가져오는 방법>
# 방법1. 데이터 프레임 형태의 파일 가져오기
# 방법2. 딕셔너리로 만들고 이후 데이터 프레임으로 변환하기
dat = {'col1': [1,2,3,4],
       'col2': [10,20,30,40],
       'col3': ['A','B','C','D']}

dat_df = DataFrame(dat)
dat_df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

#### 실습 1-5) 나만의 데이터 프레임 만들기

In [94]:
fav_dict = {'movie' : ['Mamma Mia','해어화','A Star is Born', None],
       'song'  : ['너의 의미', '섬(Queen of Diamonds)', 'Back to Black','사람이 사랑하면 안돼요'],
       'place' : ['한강','CHICAGO','NewYork','강릉']}

fav_df = DataFrame(fav_dict,index=['1st','2nd','3rd','4th'])
fav_df

              movie                  song    place
1st       Mamma Mia                 너의 의미       한강
2nd             해어화  섬(Queen of Diamonds)  CHICAGO
3rd  A Star is Born         Back to Black  NewYork
4th            None          사람이 사랑하면 안돼요       강릉

In [95]:
# 공백을 일괄적으로 채우기 위해선 딕셔너리가 아니라 Series 를 사용한다.

fav_movie = pd.Series(['Mamma Mia','해어화','A Star is Born'])
fav_song = pd.Series(['너의 의미', '섬(Queen of Diamonds)', 'Back to Black','사람이 사랑하면 안돼요'])
fav_place =pd.Series(['한강','CHICAGO','NewYork','강릉'])

fav_series ={'moveie': fav_movie, 'song':fav_song, 'place':fav_place}
fav_se_df = pd.DataFrame(fav_series)
fav_se_df

           moveie                  song    place
0       Mamma Mia                 너의 의미       한강
1             해어화  섬(Queen of Diamonds)  CHICAGO
2  A Star is Born         Back to Black  NewYork
3             NaN          사람이 사랑하면 안돼요       강릉

#### 실습 1-6)

In [100]:
from pandas import DataFrame

team_score = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000]}

team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

### 02 DataFrame에서 정보 크롭하기
* DATAFRAME[ ]        : 전체 행과 특정 열 추출
* DATAFRAME.loc[ ]    : index명으로 특정 행,열 추출
* DATAFRAME.iloc[ ]   : index위치로 특정 해,열 추출 (주의 : [1:4]는 1,2,3만 해당)

#### 실습 2-1) DATAFRAME[ ] : 전체 행과 특정 열 추출 
* 행 : 생략
* 행 : 전체선택명령어 사용 불가능 -> : (X)
* 열 : indexing 허용 -> ['col1','col2','col3'] (O)
* 열 : slicing 불가능 -> col1 : col3 (X)

In [195]:
# 전체 행을 출력하는 것이기 때문에, 행 정보는 쓰지 않는다.
# 열 선택시, 지정선택(indexing [,]) 만 허용
team_df[ ['toto','gildong'] ]

   toto  gildong
0  1500     2000
1  3000     2500
2  5000     3000
3  7000     4000
4  5500     3000

In [172]:
# 열 선택시, 범위선택(slicing :) 불가능
team_df['toto':'gildong']

TypeError: cannot do slice indexing on RangeIndex with these indexers [toto] of type str

#### 실습 2-2) DATAFRAME.loc[ ]    : index명 사용

* 행 : (주의)index 명이 1 부터 시작하면 첫번째 인덱스는 0 이 아닌 1

* entire
  * :
* 선택지정 / indexing
  * [ 'A' , 'C' ] ------- 대괄호 있음
  * 대괄호를 사용하지 않으면, 자료형 Series 형태로 가져온다.
* 범위지정 / slicing
  * 'A' : 'C' ---------- 대괄호 없음

In [179]:
# 전체 행 선택( : )
team_df.loc[:,'toto':'gildong']

   toto  apple  gildong
0  1500   4000     2000
1  3000   5000     2500
2  5000   6000     3000
3  7000   5500     4000
4  5500   4500     3000

In [181]:
# 전체 열 선택 ( : )
team_df.loc[1:3,:]

   toto  apple  gildong  catanddog
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000

In [182]:
# 지정선택 / indexing
team_df.loc[[0,2,4],['toto','gildong']]

   toto  gildong
0  1500     2000
2  5000     3000
4  5500     3000

In [207]:
# 하나 지정선택(indexing)시 대괄호를 사용하는 경우
# DataFrame형태로 가져오기
team_df.loc[:,['gildong']]

   gildong
0     2000
1     2500
2     3000
3     4000
4     3000

In [208]:
# 하나 지정선택(indexing)시 대괄호를 사용하지 않는 경우
# series형태로 가져오기
team_df.loc[:,'gildong']

0    2000
1    2500
2    3000
3    4000
4    3000
Name: gildong, dtype: int64

In [209]:
# 범위선택 / slicing
team_df.loc[1:3,'toto':'gildong']
# row 값 1:3 -> 1,2,3 출력

   toto  apple  gildong
1  3000   5000     2500
2  5000   6000     3000
3  7000   5500     4000

In [210]:
# 지정선택(indexing) + 범위선택(slicing)
team_df.loc[[0,1,4],'apple':'catanddog']     # dataframe형태로 가져오기

   apple  gildong  catanddog
0   4000     2000       7000
1   5000     2500       5000
4   4500     3000       4000

In [211]:
# 범위선택(slicing) + 지정선택(indexing)
team_df.loc[2:4, ['apple','catanddog']]

   apple  catanddog
2   6000       3000
3   5500       5000
4   4500       4000

#### 실습 2-3) DATAFRAME.iloc[ ] : index 위치 사용 (주의 : [1:4]는 1,2,3만 해당)
* 모든 인덱스는 0 부터 시작
* entire
  * :
* 선택지정 / indexing
  * [ 1 , 3 ] ------- 대괄호 있음
  * 대괄호를 사용하지 않으면, 자료형 Series 형태로 가져온다.

* 범위지정 / slicing
  * 1 : 3 ---------- 대괄호 없음
  * (주의!) 1:3의 경우 파이썬 문법에 따라 3은 제외
  * (응용1) 0:5:2 -> 0, 2, 4
  * (응용2) 5:0:-2 -> 5, 3, 1
  * (응용3) -1: -> 뒤에서부터

In [212]:
# 전체 선택
team_df.iloc[:,:]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [204]:
# 지정선택 / indexing
team_df.iloc[[0],:]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000

In [213]:
# 지정선택 / indexing
# 하나 지정선택(indexing)시 대괄호를 사용하지 않으면, 자료형 Series 형태로 가져온다.
team_df.iloc[0,:]

toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 0, dtype: int64

In [217]:
# 지정선택 / indexing
team_df.iloc[ [2,4],: ]

   toto  apple  gildong  catanddog
2  5000   6000     3000       3000
4  5500   4500     3000       4000

In [218]:
# 범위선택 / slicing
team_df.iloc[ 2:4 , : ]   # 4-1= 3 까지

   toto  apple  gildong  catanddog
2  5000   6000     3000       3000
3  7000   5500     4000       5000

In [221]:
# 선택지정(indexing)+ 범위선택(slicing)
team_df.iloc[[1,4],1:4]

   apple  gildong  catanddog
1   5000     2500       5000
4   4500     3000       4000